* Reminders CLI Journal
:LOGBOOK:
CLOCK: [2022-08-24 Wed 14:25]--[2022-08-24 Wed 14:54] =>  0:29
CLOCK: [2022-08-23 Tue 13:00]--[2022-08-23 Tue 13:42] =>  0:42
CLOCK: [2022-08-22 Mon 17:45]--[2022-08-22 Mon 18:30] =>  0:45
CLOCK: [2022-08-21 Sun 20:10]--[2022-08-21 Sun 20:59] =>  0:49
CLOCK: [2022-08-21 Sun 17:17]--[2022-08-21 Sun 17:29] =>  0:12
CLOCK: [2022-08-21 Sun 17:04]--[2022-08-21 Sun 17:09] =>  0:05
CLOCK: [2022-08-21 Sun 13:54]--[2022-08-21 Sun 13:57] =>  0:03
CLOCK: [2022-08-21 Sun 13:46]--[2022-08-21 Sun 13:53] =>  0:07
CLOCK: [2022-08-21 Sun 13:22]--[2022-08-21 Sun 13:45] =>  0:23
:END:


** DONE Speed up autocomplete in Swift

** DONE Memoize fsWatchExts and fsWatchDirs

** DONE Memoize getFolderUrls

** DONE Debugging capabilities

- Use VSCode?

*** TODO Redo Readme

** TODO Testing?

** TODO Implement a dry-run option (-n, probably)

*** TODO Get rid of references to original

** TODO Review Original Code

*** TODO Delete any unused relics

- around code "urls.count != 0 && !notif"

  
** TODO Org Compat

*** TODO Create variables for: 

**** TODO extensions

***** DONE string builder in swift to build "-i *.scan.[ext]$" for loop 

**** TODO todo strings

**** TODO time/date strings

**** TODO lists of valid TODO states

***** TODO consider scanning for this somewhere, top of file, or emacs config

** TODO Clean Up

*** TODO Extract functionality into functions, to improve ease of reading
